# 131
과일 = ["사과", "귤", "수박"]
for 변수 in 과일:
    print(변수)

# 132
과일 = ["사과", "귤", "수박"]
for 변수 in 과일:
    print("#####")
# 들여쓰기 된 코드가 자료구조에 저장된 데이터 개수만큼 반복된다.

# 133
for 변수 in ["A", "B", "C"]:
    print(변수)

# 134
for 변수 in ["A", "B", "C"]:
    print("출력:", 변수)

# 135
for 변수 in ["A", "B", "C"]:
    b = 변수.lower()
    print("변환:", b)

# 136
for 변수 in [10, 20, 30]:
    print(변수)

# 137
print(10)
print(20)
print(30)

# 138
for 변수 in [10, 20, 30]:
    print(변수)
    print("-------")

# 139
print("++++")
for 변수 in [10, 20, 30]:
    print(변수)

# 140
for 변수 in [1, 2, 3, 4]:
    print("-------")
# -------가 4번 출력
